wizmo2/squeezelite-esp32/components/services/accessors.c
/*
   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include <stdio.h>
#include "esp_log.h"
#include "driver/gpio.h"
#include "driver/i2c.h"
#include "driver/spi_master.h"
#include "platform_config.h"
#include "accessors.h"
#include "globdefs.h"
#include "display.h"
#include "cJSON.h"
#include "driver/gpio.h"
#include "stdbool.h"
#include "driver/adc.h"
#include "esp_attr.h"
#include "soc/spi_periph.h"
#include "esp_err.h"
#include "soc/rtc.h"
#include "sdkconfig.h"
#include "soc/efuse_periph.h"
#include "driver/gpio.h"
#include "driver/spi_common_internal.h"
#if CONFIG_IDF_TARGET_ESP32   
#include "esp32/rom/efuse.h"
#endif
#include "tools.h"
#include "monitor.h"
#include "messaging.h"
#include "network_ethernet.h"

static const char *TAG = "services";
const char *i2c_name_type="I2C";
const char *spi_name_type="SPI";
cJSON * gpio_list=NULL;
#define min(a,b) (((a) < (b)) ? (a) : (b))
#ifndef QUOTE
	#define QUOTE(name) #name
#endif
#ifndef STR
	#define STR(macro)  QUOTE(macro)
#endif

extern cJSON * get_gpio_list(bool refresh);
bool are_statistics_enabled(){
#if defined(CONFIG_FREERTOS_USE_TRACE_FACILITY) &&  defined (CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS)
	return true;
#endif
	return false;
}

/****************************************************************************************
 * Set pin from config string
 */
static void set_i2s_pin(char *config, i2s_pin_config_t *pin_config) {
	pin_config->bck_io_num = pin_config->ws_io_num = pin_config->data_out_num = pin_config->data_in_num = -1;
	PARSE_PARAM(config, "bck", '=', pin_config->bck_io_num);
	PARSE_PARAM(config, "ws", '=', pin_config->ws_io_num);
	PARSE_PARAM(config, "do", '=', pin_config->data_out_num);
#if CONFIG_ADC_SINK
	PARSE_PARAM(config, "di", '=', pin_config->data_in_num);
#endif 
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
    pin_config->mck_io_num = strcasestr(config, "mck") ? 0 : -1;
    PARSE_PARAM(config, "mck", '=', pin_config->mck_io_num);   
#endif    
}

/****************************************************************************************
 * Get i2s config structure from config string
 */
const i2s_platform_config_t * config_i2s_get_from_str(char * dac_config ){
	static EXT_RAM_ATTR i2s_platform_config_t i2s_dac_pin;
	memset(&i2s_dac_pin, 0xff, sizeof(i2s_dac_pin));
	set_i2s_pin(dac_config, &i2s_dac_pin.pin);
	strcpy(i2s_dac_pin.model, "i2s");
	char * p=NULL;

	PARSE_PARAM(dac_config, "i2c", '=', i2s_dac_pin.i2c_addr);
	PARSE_PARAM(dac_config, "sda", '=', i2s_dac_pin.sda);
	PARSE_PARAM(dac_config, "scl", '=', i2s_dac_pin.scl);
	PARSE_PARAM_STR(dac_config, "model", '=', i2s_dac_pin.model, 31);
	if ((p = strcasestr(dac_config, "mute"))) {
		char mute[8] = "";
		sscanf(p, "%*[^=]=%7[^,]", mute);
		i2s_dac_pin.mute_gpio = atoi(mute);
		PARSE_PARAM(p, "mute", ':', i2s_dac_pin.mute_level);
	}	
	return &i2s_dac_pin;
}

/****************************************************************************************
 * Get eth config structure from config string
 */
const eth_config_t * config_eth_get_from_str(char* config ){
	static EXT_RAM_ATTR eth_config_t eth_config; 
	eth_config.rst = eth_config.intr = -1;

	PARSE_PARAM_STR(config, "model", '=', eth_config.model, 15);
	PARSE_PARAM(config, "rst", '=', eth_config.rst);
	// RMII
	PARSE_PARAM(config, "mdc", '=', eth_config.mdc);
	PARSE_PARAM(config, "mdio", '=', eth_config.mdio);
	// SPI
	PARSE_PARAM(config, "intr", '=', eth_config.intr);
	PARSE_PARAM(config, "cs", '=', eth_config.cs);
	PARSE_PARAM(config, "speed", '=', eth_config.speed);
	/* not used as SPI must be shared
	PARSE_PARAM(config, "mosi", '=', eth_config.mosi);
	PARSE_PARAM(config, "miso", '=', eth_config.miso);
	PARSE_PARAM(config, "clk", '=', eth_config.clk);
	PARSE_PARAM(config, "host", '=', eth_config.host);
	*/

	// only system host is available
	eth_config.host = spi_system_host;
	eth_config.valid = true;

	if(!eth_config.model || strlen(eth_config.model)==0){
		eth_config.valid = false;
		return &eth_config;
	}

	network_ethernet_driver_t* network_driver = network_ethernet_driver_autodetect(eth_config.model);
	
	if(!network_driver || !network_driver->valid){
		messaging_post_message(MESSAGING_ERROR,MESSAGING_CLASS_SYSTEM,"Ethernet config invalid: model %s %s",eth_config.model,network_driver?"was not compiled in":"was not found"); 
		eth_config.valid = false;
	}
	
	if(network_driver){
		eth_config.rmii = network_driver->rmii;
		eth_config.spi = network_driver->spi;

		if(network_driver->rmii){
			if(!GPIO_IS_VALID_GPIO(eth_config.mdio) || !GPIO_IS_VALID_GPIO(eth_config.mdc)){
				messaging_post_message(MESSAGING_ERROR,MESSAGING_CLASS_SYSTEM,"Ethernet config invalid: %s %s",!GPIO_IS_VALID_GPIO(eth_config.mdc)?"Invalid MDC":"",!GPIO_IS_VALID_GPIO(eth_config.mdio)?"Invalid mdio":""); 
				eth_config.valid = false;
			}
		}
		else if(network_driver->spi){
			if(!GPIO_IS_VALID_GPIO(eth_config.cs)){
				messaging_post_message(MESSAGING_ERROR,MESSAGING_CLASS_SYSTEM,"Ethernet config invalid: invalid CS pin"); 
				return false;
			}
		}
	}
	return &eth_config;
}

/****************************************************************************************
 * Get spdif config structure 
 */
const i2s_platform_config_t * config_spdif_get( ){
	char * spdif_config = config_alloc_get_str("spdif_config", NULL, CONFIG_SPDIF_CONFIG);
	static EXT_RAM_ATTR i2s_platform_config_t i2s_dac_config;
	memcpy(&i2s_dac_config, config_i2s_get_from_str(spdif_config), sizeof(i2s_dac_config));
	free(spdif_config);
	return &i2s_dac_config;
}

/****************************************************************************************
 * Get dac config structure 
 */
const i2s_platform_config_t * config_dac_get(){
	char * spdif_config = config_alloc_get_str("dac_config", NULL, CONFIG_DAC_CONFIG);
	static EXT_RAM_ATTR i2s_platform_config_t i2s_dac_config;
	memcpy(&i2s_dac_config, config_i2s_get_from_str(spdif_config), sizeof(i2s_dac_config));
	free(spdif_config);
	return &i2s_dac_config;
}
#if CONFIG_ADC_SINK
/****************************************************************************************
 * Get adc config structure 
 */
const i2s_platform_config_t * config_adc_get( ){
	char * adc_config = config_alloc_get_str("adc_config", NULL, CONFIG_SPDIF_CONFIG);
	static EXT_RAM_ATTR i2s_platform_config_t i2s_dac_config;
	memcpy(&i2s_dac_config, config_i2s_get_from_str(adc_config), sizeof(i2s_dac_config));
	free(adc_config);
	return &i2s_dac_config;
}
#endif

/****************************************************************************************
 * Get ethernet config structure 
 */
const eth_config_t * config_eth_get( ){
	char * config = config_alloc_get_str("eth_config", CONFIG_ETH_CONFIG, "rst=" STR(CONFIG_ETH_PHY_RST_IO) 

#if defined(ETH_LAN8720)
#else 
#if defined(CONFIG_ETH_USE_SPI_ETHERNET)
#if defined(CONFIG_ETH_DM9051)
										 ",model=dm9051"
#elif defined(CONFIG_ETH_W5500)
										 ",model=w5500"
#endif
										 ",host=" STR(CONFIG_ETH_SPI_HOST) ",cs=" STR(CONFIG_ETH_SPI_CS_IO)
										 ",mosi=" STR(CONFIG_ETH_SPI_MOSI_IO) ",miso=" STR(CONFIG_ETH_SPI_MISO_IO) 
										 ",intr=" STR(CONFIG_ETH_SPI_INTR_IO)
										 ",clk=" STR(CONFIG_ETH_SPI_CLK_IO) ",speed=" STR(CONFIG_ETH_SPI_SPEED) 

