wizmo2/squeezelite-esp32/components/services/accessors.c
#elif defined(CONFIG_ETH_PHY_INTERFACE_RMII)
										 ",model=lan8720, tx_en=21, tx0=19, tx1=22, rx0=25, rx1=26, crs_dv=27"
#endif
#endif
										",mdc=" STR(CONFIG_ETH_MDC_IO) ",mdio=" STR(CONFIG_ETH_MDIO_IO)) ;
	if(config && strlen(config)>0){
		ESP_LOGD(TAG,"Parsing ethernet configuration %s", config);
	}
	static EXT_RAM_ATTR eth_config_t eth_config;
	memcpy(&eth_config, config_eth_get_from_str(config), sizeof(eth_config));
	FREE_AND_NULL(config);
	return &eth_config;
}
/****************************************************************************************
 * Get ethernet config structure and assign to eth config structure
 */
void config_eth_init( eth_config_t *  target ){
	const eth_config_t * source =  config_eth_get();
	memcpy(target,source,sizeof(eth_config_t));
}

/****************************************************************************************
 * 
 */
esp_err_t config_i2c_set(const i2c_config_t * config, int port){
	int buffer_size=255;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	if(config_buffer)  {
		snprintf(config_buffer,buffer_size,"scl=%u,sda=%u,speed=%u,port=%u",config->scl_io_num,config->sda_io_num,config->master.clk_speed,port);
		log_send_messaging(MESSAGING_INFO,"Updating I2C configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "i2c_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}		
		free(config_buffer);
	}
	return err;
}

/****************************************************************************************
 * 
 */
esp_err_t config_rotary_set(rotary_struct_t * config){
	int buffer_size=512;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	char * config_buffer2=malloc_init_external(buffer_size);	
	if(config_buffer && config_buffer2)  {
		snprintf(config_buffer,buffer_size,"A=%i,B=%i",config->A, config->B);
		if(config->SW >=0 ){
			snprintf(config_buffer2,buffer_size,"%s,SW=%i",config_buffer,config->SW);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->knobonly){
			strncat(config_buffer,",knobonly",buffer_size);
			if(config->timer>0){
				snprintf(config_buffer2,buffer_size,"%s=%i",config_buffer,config->timer);
				strcpy(config_buffer,config_buffer2);
			}
		}
		if(config->volume_lock){
			strncat(config_buffer,",volume",buffer_size);
		}
		if(config->longpress){
			strncat(config_buffer,",longpress",buffer_size);
		}
			log_send_messaging(MESSAGING_INFO,"Updating rotary configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "rotary_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	FREE_AND_NULL(config_buffer2);	
	return err;	
}

/****************************************************************************************
 * 
 */
esp_err_t config_ledvu_set(ledvu_struct_t * config){
	int buffer_size=512;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	if(config_buffer)  {
		snprintf(config_buffer,buffer_size,"type=%s,length=%i,gpio=%i,clk=%i,scale=%i",config->type, config->length, config->gpio, config->clk, config->scale);
		log_send_messaging(MESSAGING_INFO,"Updating ledvu configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "led_vu_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	return err;	
}
#if CONFIG_ADC_SINK
esp_err_t config_adcout_set(adcout_struct_t * adcout){
	int buffer_size=512;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	if(config_buffer)  {
		snprintf(config_buffer,buffer_size,"rate=%u,host=%s,port=%u",adcout->rate, adcout->host, adcout->port);
		log_send_messaging(MESSAGING_INFO,"Updating adc output configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "adc_stream", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	return err;	
}
#endif
/****************************************************************************************
 * 
 */
esp_err_t config_display_set(const display_config_t * config){
	int buffer_size=512;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	char * config_buffer2=malloc_init_external(buffer_size);
	if(config_buffer && config_buffer2)  {
		snprintf(config_buffer,buffer_size,"%s,width=%i,height=%i",config->type,config->width,config->height);
		if(strcasecmp("I2C",config->type)==0){
			if(config->address>0 ){
				snprintf(config_buffer2,buffer_size,"%s,address=%i",config_buffer,config->address);
				strcpy(config_buffer,config_buffer2);
			}
		}
		else {
			if(config->CS_pin >=0 ){
				snprintf(config_buffer2,buffer_size,"%s,cs=%i",config_buffer,config->CS_pin);
				strcpy(config_buffer,config_buffer2);
			}		
		}
		if(config->RST_pin >=0 ){
			snprintf(config_buffer2,buffer_size,"%s,reset=%i",config_buffer,config->RST_pin);
			strcpy(config_buffer,config_buffer2);
		}		
// I2C,width=<pixels>,height=<pixels>[address=<i2c_address>][,reset=<gpio>][,HFlip][,VFlip][driver=SSD1306|SSD1326[:1|4]|SSD1327|SH1106]
// SPI,width=<pixels>,height=<pixels>,cs=<gpio>[,back=<gpio>][,reset=<gpio>][,speed=<speed>][,HFlip][,VFlip][driver=SSD1306|SSD1322|SSD1326[:1|4]|SSD1327|SH1106|SSD1675|ST7735|ST7789[,rotate]]		
		if(config->back >=0 ){
			snprintf(config_buffer2,buffer_size,"%s,back=%i",config_buffer,config->back);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->speed >0 && strcasecmp("SPI",config->type)==0){
			snprintf(config_buffer2,buffer_size,"%s,speed=%i",config_buffer,config->speed);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->mode >=0 && strcasecmp("SPI",config->type)==0){
			snprintf(config_buffer2,buffer_size,"%s,mode=%i",config_buffer,config->mode);
			strcpy(config_buffer,config_buffer2);
		}
		snprintf(config_buffer2,buffer_size,"%s,driver=%s%s%s%s",config_buffer,config->drivername,config->hflip?",HFlip":"",config->vflip?",VFlip":"",config->rotate?",rotate":"");
		strcpy(config_buffer,config_buffer2);
		log_send_messaging(MESSAGING_INFO,"Updating display configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "display_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	FREE_AND_NULL(config_buffer2);	
	return err;
}

/****************************************************************************************
 * 
 */
esp_err_t config_i2s_set(const i2s_platform_config_t * config, const char * nvs_name){
	int buffer_size=255;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	char * config_buffer2=malloc_init_external(buffer_size);
	if(config_buffer && config_buffer2)  {
		snprintf(config_buffer,buffer_size,"model=%s,bck=%u,ws=%u",config->model,config->pin.bck_io_num,config->pin.ws_io_num);
		if(config->pin.data_out_num>=0){
			snprintf(config_buffer2,buffer_size,"%s,do=%u",config_buffer,config->pin.data_out_num);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->pin.data_in_num>=0){
			snprintf(config_buffer2,buffer_size,"%s,di=%u",config_buffer,config->pin.data_in_num);
			strcpy(config_buffer,config_buffer2);
		}
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0) 		
		if(config->pin.mck_io_num>=0){
			snprintf(config_buffer2,buffer_size,"%s,mck=%u",config_buffer,config->pin.mck_io_num);
			strcpy(config_buffer,config_buffer2);
		}
#endif		
		if(config->mute_gpio>=0){
			snprintf(config_buffer2,buffer_size,"%s,mute=%u:%u",config_buffer,config->mute_gpio,config->mute_level);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->sda>=0){
			snprintf(config_buffer2,buffer_size,"%s,sda=%u,scl=%u",config_buffer,config->sda,config->scl);
			strcpy(config_buffer,config_buffer2);
		}
		if(config->i2c_addr>0){
			snprintf(config_buffer2,buffer_size,"%s,i2c=%u",config_buffer,config->i2c_addr);
			strcpy(config_buffer,config_buffer2);
		}
		log_send_messaging(MESSAGING_INFO,"Updating dac configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, nvs_name, config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	FREE_AND_NULL(config_buffer2);	
	return err;
}

/****************************************************************************************
 * 
 */
esp_err_t config_spdif_set(const i2s_platform_config_t * config){
	int buffer_size=255;
	esp_err_t err=ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	if(config_buffer )  {
		snprintf(config_buffer,buffer_size,"bck=%u,ws=%u,do=%u",config->pin.bck_io_num,config->pin.ws_io_num,config->pin.data_out_num);
		log_send_messaging(MESSAGING_INFO,"Updating SPDIF configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "spdif_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}		
	} 
	else {
		err = ESP_ERR_NO_MEM;
	}
	FREE_AND_NULL(config_buffer);
	return err;
}

/****************************************************************************************
 *
 */
esp_err_t config_spi_set(const spi_bus_config_t * config, int host, int dc){
	int buffer_size=255;
	esp_err_t err = ESP_OK;
	char * config_buffer=malloc_init_external(buffer_size);
	if(config_buffer)  {
		snprintf(config_buffer,buffer_size,"data=%u,clk=%u,dc=%u,host=%u,miso=%d",config->mosi_io_num,config->sclk_io_num,dc,host,config->miso_io_num);
		log_send_messaging(MESSAGING_INFO,"Updating SPI configuration to %s",config_buffer);
		err = config_set_value(NVS_TYPE_STR, "spi_config", config_buffer);
		if(err!=ESP_OK){
			log_send_messaging(MESSAGING_ERROR,"Error: %s",esp_err_to_name(err));
		}		
		free(config_buffer);
	}
	return err;
}

/****************************************************************************************
 * 
 */
const display_config_t * config_display_get(){
	static display_config_t dstruct = {
		.back = -1,
		.CS_pin = -1,
		.RST_pin = -1,
		.depth = -1,
		.address = 0,
		.drivername = NULL,
		.height = 0,
		.width = 0,
		.vflip = false,
		.hflip = false,
		.type = NULL,
		.speed = 0,
		.rotate = false,
		.invert = false,
		.colorswap = 0,
		.mode = 0,
	};
	char *config = config_alloc_get(NVS_TYPE_STR, "display_config");
	if (!config) {
		return NULL;
	}

	char * p=NULL;

	if ((p = strcasestr(config, "driver")) != NULL){
		sscanf(p, "%*[^:]:%u", &dstruct.depth);
		dstruct.drivername = display_conf_get_driver_name(strchr(p, '=') + 1);
	}

	PARSE_PARAM(config, "width", '=', dstruct.width);
	PARSE_PARAM(config, "height", '=', dstruct.height);
	PARSE_PARAM(config, "reset", '=', dstruct.RST_pin);
	PARSE_PARAM(config, "address", '=', dstruct.address);
	PARSE_PARAM(config, "cs", '=', dstruct.CS_pin);
	PARSE_PARAM(config, "speed", '=', dstruct.speed);
	PARSE_PARAM(config, "back", '=', dstruct.back);
	PARSE_PARAM(config, "mode", '=', dstruct.mode);

	if (strstr(config, "I2C") ) dstruct.type=i2c_name_type;
	if (strstr(config, "SPI") ) dstruct.type=spi_name_type;

	dstruct.hflip= strcasestr(config, "HFlip") ? true : false;
	dstruct.vflip= strcasestr(config, "VFlip") ? true : false;
	dstruct.rotate= strcasestr(config, "rotate") ? true : false;
	dstruct.invert= strcasestr(config, "invert") ? true : false;
	dstruct.colorswap= strcasestr(config, "cswap") ? 1 : 0;
	return &dstruct;
}

/****************************************************************************************
 * 
 */
const i2c_config_t * config_i2c_get(int * i2c_port) {
	char *nvs_item;
	static i2c_config_t i2c = {
		.mode = I2C_MODE_MASTER,
		.sda_io_num = -1,
		.sda_pullup_en = GPIO_PULLUP_ENABLE,
		.scl_io_num = -1,
		.scl_pullup_en = GPIO_PULLUP_ENABLE,
		.master.clk_speed = 0,
	};

