wizmo2/squeezelite-esp32/components/services/accessors.c
	i2c.master.clk_speed = i2c_system_speed;
	
	nvs_item = config_alloc_get_default(NVS_TYPE_STR, "i2c_config", NULL, CONFIG_I2C_CONFIG);
	if (nvs_item) {
		PARSE_PARAM(nvs_item, "scl", '=', i2c.scl_io_num);
		PARSE_PARAM(nvs_item, "sda", '=', i2c.sda_io_num);
		PARSE_PARAM(nvs_item, "speed", '=', i2c.master.clk_speed);
		PARSE_PARAM(nvs_item, "port", '=', i2c_system_port);
		free(nvs_item);
	}
	if(i2c_port) {
#ifdef CONFIG_I2C_LOCKED
		*i2c_port= I2C_NUM_1;
#else
		*i2c_port=i2c_system_port;
#endif		
	}
	return &i2c;
}

/****************************************************************************************
 * Get IO expander config structure from config string
 */
const gpio_exp_config_t* config_gpio_exp_get(int index) {
	char *nvs_item, *item, *p;
	static gpio_exp_config_t config;

	// re-initialize config every time
	memset(&config, 0, sizeof(config));
	config.intr = -1; config.count = 16; config.base = GPIO_NUM_MAX; config.phy.port = i2c_system_port; config.phy.host = spi_system_host;

	nvs_item = config_alloc_get(NVS_TYPE_STR, "gpio_exp_config");
	if (!nvs_item || !*nvs_item) return NULL;

	// search index items
	for (item = strtok(nvs_item, ";"); index && item; index--) {
		if ((item = strtok(NULL, ";")) == NULL) {
			free(nvs_item);
			return NULL;
		}
	}

	PARSE_PARAM(item, "addr", '=', config.phy.addr);
	PARSE_PARAM(item, "cs", '=', config.phy.cs_pin);
	PARSE_PARAM(item, "speed", '=', config.phy.speed);
	PARSE_PARAM(item, "intr", '=', config.intr);
	PARSE_PARAM(item, "base", '=', config.base);
	PARSE_PARAM(item, "count", '=', config.count);
	PARSE_PARAM_STR(item, "model", '=', config.model, sizeof(config.model)-1);

	if ((p = strcasestr(item, "port")) != NULL) {
		char port[8] = "";
		sscanf(p, "%*[^=]=%7[^,]", port);
		if (strcasestr(port, "dac")) config.phy.port = 0;
	}	

	free(nvs_item);
	return &config;
}	

/****************************************************************************************
 * 
 */
const gpio_with_level_t * get_gpio_struct_member(const char * nvs_item, const char * name){
	static gpio_with_level_t gpio_member={
		.gpio=-1,
		.level=0
	};
	if(!nvs_item) return &gpio_member;
	const char * p=nvs_item;
	char type[20]={0};
	int match=0;
	do {
		if ((match=sscanf(p, "%d=%19[^,:]:%d", &gpio_member.gpio, type,&gpio_member.level)) >0 && (GPIO_IS_VALID_GPIO(gpio_member.gpio) ||  gpio_member.gpio==GPIO_NUM_NC) && strcasestr(type,name)){
            return &gpio_member;
		}
		p = strchr(p, ',');
	} while (p++);
	gpio_member.gpio=-1;
	gpio_member.level=0;
    return &gpio_member;
}

#define HANDLE_GPIO_STRUCT_MEMBER(name,fixval) memcpy(&gpio_struct.name, get_gpio_struct_member(nvs_item, QUOTE(name)), sizeof(gpio_struct.name)); gpio_struct.name.fixed=fixval
#define ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(array,structvar,name,type) if(((set_GPIO_struct_t *)structvar)->name.gpio>=0){cJSON_AddItemToArray(array,get_gpio_entry(QUOTE(name),type,((set_GPIO_struct_t *)structvar)->name.gpio, ((set_GPIO_struct_t *)structvar)->name.fixed));}
/****************************************************************************************
 * 
 */
const set_GPIO_struct_t * get_gpio_struct(){
	static set_GPIO_struct_t gpio_struct;
	char * nvs_item=config_alloc_get(NVS_TYPE_STR, "set_GPIO");
#ifdef CONFIG_LED_GREEN_GPIO_LEVEL
		gpio_struct.green.level = CONFIG_LED_GREEN_GPIO_LEVEL;
#endif
#ifdef CONFIG_LED_GREEN_GPIO
		gpio_struct.green.gpio = CONFIG_LED_GREEN_GPIO;
#endif
#ifdef CONFIG_LED_RED_GPIO_LEVEL
		gpio_struct.green.level = CONFIG_LED_RED_GPIO_LEVEL;
#endif
#ifdef CONFIG_LED_RED_GPIO
		gpio_struct.red.gpio = CONFIG_LED_RED_GPIO;
#endif	
#if  defined(CONFIG_POWER_GPIO) && CONFIG_POWER_GPIO != -1
		gpio_struct.power.gpio = CONFIG_POWER_GPIO;
#endif	
#ifdef CONFIG_POWER_GPIO_LEVEL
		gpio_struct.power.level = CONFIG_POWER_GPIO_LEVEL;
#endif	
	if(nvs_item){
		HANDLE_GPIO_STRUCT_MEMBER(amp,false);
#ifndef CONFIG_LED_LOCKED
		HANDLE_GPIO_STRUCT_MEMBER(green,false);
		HANDLE_GPIO_STRUCT_MEMBER(red,false);
#endif
		HANDLE_GPIO_STRUCT_MEMBER(jack,false);
		HANDLE_GPIO_STRUCT_MEMBER(spkfault,false);
		HANDLE_GPIO_STRUCT_MEMBER(vcc,false);
		HANDLE_GPIO_STRUCT_MEMBER(gnd,false);
		HANDLE_GPIO_STRUCT_MEMBER(ir,false);
		HANDLE_GPIO_STRUCT_MEMBER(power,false);
		free(nvs_item);
	}

#ifdef CONFIG_LED_LOCKED
		gpio_struct.red.fixed=true;
		gpio_struct.green.fixed=true;
#endif	
#ifdef CONFIG_JACK_LOCKED 
		gpio_struct.jack.gpio=CONFIG_JACK_GPIO;
		gpio_struct.jack.fixed=true;
		gpio_struct.jack.level=CONFIG_JACK_GPIO_LEVEL;
#endif
#ifdef CONFIG_SPKFAULT_LOCKED
		gpio_struct.spkfault.gpio=CONFIG_SPKFAULT_GPIO;
		gpio_struct.spkfault.fixed=true;
		gpio_struct.spkfault.level=CONFIG_SPKFAULT_GPIO_LEVEL;
#endif
	return &gpio_struct;	
}

/****************************************************************************************
 * 
 */
const spi_bus_config_t * config_spi_get(spi_host_device_t * spi_host) {
	char *nvs_item;
	// don't memset all to 0xff as it's more than just GPIO
	static spi_bus_config_t spi = {
		.mosi_io_num = -1,
        .sclk_io_num = -1,
        .miso_io_num = -1,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1
    };
		
	nvs_item = config_alloc_get_str("spi_config", NULL, CONFIG_SPI_CONFIG);
	if (nvs_item) {
		PARSE_PARAM(nvs_item, "data", '=', spi.mosi_io_num);
		PARSE_PARAM(nvs_item, "mosi", '=', spi.mosi_io_num);
		PARSE_PARAM(nvs_item, "miso", '=', spi.miso_io_num);
		PARSE_PARAM(nvs_item, "clk", '=', spi.sclk_io_num);
		PARSE_PARAM(nvs_item, "dc", '=', spi_system_dc_gpio);
		// only VSPI (1) can be used as Flash and PSRAM run at 80MHz
		// if ((p = strcasestr(nvs_item, "host")) != NULL) spi_system_host = atoi(strchr(p, '=') + 1);
		free(nvs_item);
	}
	if(spi_host) *spi_host = spi_system_host;
	return &spi;
}

/****************************************************************************************
 * 
 */
void parse_set_GPIO(void (*cb)(int gpio, char *value)) {
	char *nvs_item, *p, type[16];
	int gpio;
	
	if ((nvs_item = config_alloc_get(NVS_TYPE_STR, "set_GPIO")) == NULL) return;
	
	p = nvs_item;
	
	do {
		if (sscanf(p, "%d=%15[^,]", &gpio, type) > 0) cb(gpio, type);
		p = strchr(p, ',');
	} while (p++);
	
