wizmo2/squeezelite-esp32/components/services/accessors.c
	free(nvs_item);
}	

/****************************************************************************************
 * 
 */
const rotary_struct_t * config_rotary_get() {

	static rotary_struct_t rotary={  .A = -1, .B = -1, .SW = -1, .longpress = false, .knobonly=false,.timer=0,.volume_lock=false};
	char *config = config_alloc_get_default(NVS_TYPE_STR, "rotary_config", NULL, CONFIG_ROTARY_ENCODER);
	if (config && *config) {
		char *p;

		// parse config
		PARSE_PARAM(config, "A", '=', rotary.A);
		PARSE_PARAM(config, "B", '=', rotary.B);
		PARSE_PARAM(config, "SW", '=', rotary.SW);
		if ((p = strcasestr(config, "knobonly")) != NULL) {
			p = strchr(p, '=');
			rotary.knobonly = true;
			rotary.timer = p ? atoi(p + 1) : 350;
			rotary.longpress = false;
		} else {
			rotary.knobonly = false;
			rotary.timer = 0;
			if ((p = strcasestr(config, "volume")) != NULL) rotary.volume_lock = true;
			if ((p = strcasestr(config, "longpress")) != NULL) rotary.longpress = true;
		}	
		free(config);
	}
	return &rotary;
}

/****************************************************************************************
 * 
 */
const ledvu_struct_t * config_ledvu_get() {

	static ledvu_struct_t ledvu={ .type = "WS2812", .gpio = -1, .length = 0, .clk = -1, .seq="", .scale= 100 };
	char *config = config_alloc_get_default(NVS_TYPE_STR, "led_vu_config", NULL, 0);
	if (config && *config) {
		PARSE_PARAM_STR(config, "type", '=', ledvu.type, 15);
		PARSE_PARAM(config, "gpio", '=', ledvu.gpio);
		PARSE_PARAM(config, "clk", '=', ledvu.clk);
		PARSE_PARAM(config, "length", '=', ledvu.length);
		PARSE_PARAM_STR(config, "seq", '=', ledvu.seq, 10);
		PARSE_PARAM(config, "scale", '=', ledvu.scale);
		free(config);
	}
	return &ledvu;
}
#if CONFIG_ADC_SINK
/****************************************************************************************
 * 
 */
const adcout_struct_t * config_adcout_get() {

	static adcout_struct_t adcout={ .rate = 16000, .host = "", .port=0 };
	char *config = config_alloc_get_default(NVS_TYPE_STR, "adc_stream", NULL, 0);
	if (config && *config) {
		PARSE_PARAM(config, "rate", '=', adcout.rate);
		PARSE_PARAM_STR(config, "host", '=', adcout.host, 32);
		PARSE_PARAM(config, "port", '=', adcout.port);
		free(config);
	}
	return &adcout;
}
#endif
/****************************************************************************************
 *
 */
cJSON * get_gpio_entry(const char * name, const char * prefix, int gpio, bool fixed){
	cJSON * entry = cJSON_CreateObject();
	cJSON_AddNumberToObject(entry,"gpio",gpio);
	cJSON_AddStringToObject(entry,"name",name);
	cJSON_AddStringToObject(entry,"group",prefix);
	cJSON_AddBoolToObject(entry,"fixed",fixed);
	return entry;
}

/****************************************************************************************
 *
 */
cJSON * add_gpio_for_value(cJSON * list,const char * name,int gpio, const char * prefix, bool fixed){
	cJSON * llist = list?list:cJSON_CreateArray();
	if(GPIO_IS_VALID_GPIO(gpio) && gpio>0){
		cJSON_AddItemToArray(llist,get_gpio_entry(name,prefix,gpio,fixed));
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * add_gpio_for_name(cJSON * list,const char * nvs_entry,const char * name, const char * prefix, bool fixed){
	cJSON * llist = list?list:cJSON_CreateArray();
	int gpioNum=0;
	PARSE_PARAM(nvs_entry, name, '=', gpioNum);
	if(gpioNum>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry(name,prefix,gpioNum,fixed));
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_GPIO_nvs_list(cJSON * list) {
	cJSON * ilist = list?list:cJSON_CreateArray();
	const set_GPIO_struct_t * gpios = get_gpio_struct();
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,vcc,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,gnd,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,amp,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,ir,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,jack,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,green,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,red,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,power,"other");
	ADD_GPIO_STRUCT_MEMBER_TO_ARRAY(ilist,gpios,spkfault,"other");
	return ilist;
}

/****************************************************************************************
 *
 */
cJSON * get_DAC_GPIO(cJSON * list){
#ifdef CONFIG_DAC_LOCKED
    bool fixed = CONFIG_DAC_LOCKED;
#else
    bool fixed = false;
#endif
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	const i2s_platform_config_t * i2s_config= config_dac_get();
	if(i2s_config->pin.bck_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("bck","dac",i2s_config->pin.bck_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("ws","dac",i2s_config->pin.ws_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("do","dac",i2s_config->pin.data_out_num,fixed));
		if(i2s_config->sda>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("sda","dac",i2s_config->sda,fixed));
			cJSON_AddItemToArray(llist,get_gpio_entry("scl","dac",i2s_config->scl,fixed));
		}
		if(i2s_config->mute_gpio>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("mute","dac",i2s_config->mute_gpio,fixed));
		}
	}
	return llist;
}
#if CONFIG_ADC_SINK
/****************************************************************************************
 *
 */
cJSON * get_ADC_GPIO(cJSON * list){
#ifdef CONFIG_ADC_LOCKED
    bool fixed = CONFIG_ADC_LOCKED;
#else
    bool fixed = false;
#endif
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	const i2s_platform_config_t * i2s_config= config_adc_get();
	if(i2s_config->pin.bck_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("bck","adc",i2s_config->pin.bck_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("ws","adc",i2s_config->pin.ws_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("di","adc",i2s_config->pin.data_in_num,fixed));
		if(i2s_config->pin.mck_io_num>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("mck","adc",i2s_config->pin.mck_io_num,fixed));
		}
		if(i2s_config->sda>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("sda","adc",i2s_config->sda,fixed));
			cJSON_AddItemToArray(llist,get_gpio_entry("scl","adc",i2s_config->scl,fixed));
		}
		if(i2s_config->mute_gpio>=0){
			cJSON_AddItemToArray(llist,get_gpio_entry("mute","adc",i2s_config->mute_gpio,fixed));
		}
	}
	return llist;
}
#endif

/****************************************************************************************
 *
 */
cJSON * get_Display_GPIO(cJSON * list){
#ifdef CONFIG_DISPLAY_LOCKED
	bool fixed = CONFIG_DISPLAY_LOCKED;
#else
	bool fixed = false;
#endif
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	const display_config_t * config= config_display_get();
if(config->back >=0){
	cJSON_AddItemToArray(llist,get_gpio_entry("backlight","display",config->back,fixed));
}
	if(config->CS_pin >=0){
	cJSON_AddItemToArray(llist,get_gpio_entry("CS","display",config->CS_pin,fixed));
}	
	if(config->RST_pin >=0){
	cJSON_AddItemToArray(llist,get_gpio_entry("reset","display",config->RST_pin,fixed));
}
	return llist;
}
/****************************************************************************************
 *
 */
cJSON * get_I2C_GPIO(cJSON * list){
#ifdef CONFIG_I2C_LOCKED
	bool fixed = CONFIG_I2C_LOCKED;
#else
	bool fixed = false;
#endif
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	int port=0;
	const i2c_config_t * i2c_config = config_i2c_get(&port);
	if(i2c_config->scl_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("scl","i2c",i2c_config->scl_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("sda","i2c",i2c_config->sda_io_num,fixed));
	}
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_SPI_GPIO(cJSON * list){
#if CONFIG_SPI_LOCKED
	bool fixed = CONFIG_SPI_LOCKED;
#else
	bool fixed = false;
#endif
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	spi_host_device_t spi_host;
	const spi_bus_config_t * spi_config = config_spi_get(&spi_host);
	
	if(spi_config ->mosi_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("data","spi",spi_config->mosi_io_num,fixed));
		cJSON_AddItemToArray(llist,get_gpio_entry("clk","spi",spi_config->sclk_io_num,fixed));
	}
	if(spi_system_dc_gpio>0){
		cJSON_AddItemToArray(llist,get_gpio_entry("dc","spi",spi_system_dc_gpio,fixed));
	}
	if(spi_config ->miso_io_num>=0){
		cJSON_AddItemToArray(llist,get_gpio_entry("clk","spi",spi_config->miso_io_num,fixed));
	}
	
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_eth_GPIO(cJSON * list){
	cJSON * llist = list;
	if(!llist){
		llist = cJSON_CreateArray();
	}	
	spi_host_device_t spi_host;
	const eth_config_t * eth_config = config_eth_get(&spi_host);
	#if defined(CONFIG_ETH_CONFIG)
		bool fixed = strlen(CONFIG_ETH_CONFIG)>0;
	#else
		bool fixed =false;
	#endif 
	if(eth_config->valid ){
		add_gpio_for_value(llist,"mdc",eth_config->mdc,"ethernet",fixed);
		add_gpio_for_value(llist,"rst",eth_config->rst,"ethernet",fixed);
		add_gpio_for_value(llist,"mdio",eth_config->mdio,"ethernet",fixed);
		if(eth_config->rmii){
			add_gpio_for_value(llist,"tx_en", 21,"ethernet",true);
			add_gpio_for_value(llist,"tx0",   19 ,"ethernet",true);
			add_gpio_for_value(llist,"tx1",   22 ,"ethernet",true);
			add_gpio_for_value(llist,"rx0",   25 ,"ethernet",true);
			add_gpio_for_value(llist,"rx1",   26 ,"ethernet",true);
			add_gpio_for_value(llist,"crs_dv",27 ,"ethernet",true);
		}
		else if(eth_config->spi) {
			/* SPI ethernet */
			add_gpio_for_value(llist,"cs",eth_config->cs,"ethernet",fixed);
			add_gpio_for_value(llist,"mosi",eth_config->mosi,"ethernet",fixed);
			add_gpio_for_value(llist,"miso",eth_config->miso,"ethernet",fixed);
			add_gpio_for_value(llist,"intr",eth_config->intr,"ethernet",fixed);
			add_gpio_for_value(llist,"clk",eth_config->clk,"ethernet",fixed);
		}
	}
	return llist;
}


/****************************************************************************************
 *
 */
cJSON * get_SPDIF_GPIO(cJSON * list){
#ifdef CONFIG_SPDIF_LOCKED
	bool fixed = CONFIG_SPDIF_LOCKED;
#else
	bool fixed = false;
#endif
	cJSON * llist = list?list:cJSON_CreateArray();
	char * spdif_config = config_alloc_get_str("spdif_config", NULL, CONFIG_SPDIF_CONFIG);
	if(spdif_config){
		llist = add_gpio_for_name(llist,spdif_config,"bck", "spdif", fixed);
		llist = add_gpio_for_name(llist,spdif_config,"ws",  "spdif", fixed);
		llist = add_gpio_for_name(llist,spdif_config,"do",  "spdif", fixed);
		free(spdif_config);	
	}	
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_Rotary_GPIO(cJSON * list){
	cJSON * llist = list?list:cJSON_CreateArray();
#ifdef CONFIG_ROTARY_ENCODER_LOCKED
	bool fixed = CONFIG_ROTARY_ENCODER_LOCKED;
#else
	bool fixed = false;
#endif
	const rotary_struct_t *rotary= config_rotary_get();
	add_gpio_for_value(llist,"A",rotary->A, "rotary", fixed);
	add_gpio_for_value(llist,"B",rotary->B, "rotary", fixed);
	add_gpio_for_value(llist,"SW",rotary->SW, "rotary", fixed);
	return llist;
}

/****************************************************************************************
 *
 */
cJSON * get_ledvu_GPIO(cJSON * list){
	cJSON * llist = list?list:cJSON_CreateArray();
#ifdef CONFIG_LED_VU_LOCKED
	bool fixed = CONFIG_LED_VU_LOCKED;
#else
	bool fixed = false;
#endif
	const ledvu_struct_t *ledvu= config_ledvu_get();
	add_gpio_for_value(llist,"gpio",ledvu->gpio, "led_vu", fixed);
	if (ledvu->clk >= 0)
		add_gpio_for_value(llist,"clk",ledvu->clk, "led_vu", fixed);
	return llist;
}

/****************************************************************************************
 *
 */
esp_err_t get_gpio_structure(cJSON * gpio_entry, gpio_entry_t ** gpio){
	esp_err_t err = ESP_OK;
	*gpio = malloc_init_external(sizeof(gpio_entry_t));
	cJSON * val = cJSON_GetObjectItem(gpio_entry,"gpio");
	if(val){
		(*gpio)->gpio= (int)val->valuedouble;
	} else {
		ESP_LOGE(TAG,"gpio pin not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"name");
	if(val){
		(*gpio)->name= strdup_psram(cJSON_GetStringValue(val));
	} else {
		ESP_LOGE(TAG,"gpio name value not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"group");
	if(val){
		(*gpio)->group= strdup_psram(cJSON_GetStringValue(val));
	} else {
		ESP_LOGE(TAG,"gpio group value not found");
		err=ESP_FAIL;
	}
	val = cJSON_GetObjectItem(gpio_entry,"fixed");
	if(val){
		(*gpio)->fixed= cJSON_IsTrue(val);
	} else {
		ESP_LOGE(TAG,"gpio fixed indicator not found");
		err=ESP_FAIL;
	}

